In [1]:
import pandas as pd

In [2]:
d={
    "name":["a","a","a","b","b","b"],
    "sub":[1,2,3,1,2,3],
    "q":[11,12,13,21,22,23]
}

In [3]:
db=pd.DataFrame(d)

In [4]:
db

  name  sub   q
0    a    1  11
1    a    2  12
2    a    3  13
3    b    1  21
4    b    2  22
5    b    3  23

In [5]:
grouped_db = db.groupby('name')

In [6]:
grouped_db['q'].sum()

name
a    36
b    66
Name: q, dtype: int64

In [7]:
def sum_without_3(group):
    filtered_group = group[group['sub'] != 3]
    return filtered_group.iloc[:, -1].sum()

In [8]:
total_q_without_3 = grouped_db.apply(sum_without_3)

/var/folders/wk/ylph8q1x10q_dvsr9mzx4r1r0000gn/T/ipykernel_47264/1231002757.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  total_q_without_3 = grouped_db.apply(sum_without_3)

Frozen error

/var/folders/wk/ylph8q1x10q_dvsr9mzx4r1r0000gn/T/ipykernel_47264/1231002757.py:1: DeprecationWarning: 
DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future 
version of pandas the grouping columns will be excluded from the operation. 
Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns 
after groupby to silence this warning.
  total_q_without_3 = grouped_db.apply(sum_without_3)

In [9]:
total_q_without_3

name
a    23
b    43
dtype: int64

# retry, asking to DeepSeek

In [10]:
# Group by 'name' and select only the relevant columns ('sub' and 'q')
grouped_db = db.groupby('name')[['sub', 'q']]

In [11]:
grouped_db.sum()

      sub   q
name
a       6  36
b       6  66

In [12]:
total_q_without_3 = grouped_db.apply(sum_without_3)

In [13]:
total_q_without_3

name
a    23
b    43
dtype: int64

In [14]:
total_q_without_3['a']

23